[{"_id":"p1","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"What is PHP","bio":"PHP is an open-source, interpreted, and object-oriented scripting language that can be executed at the server-side. PHP is well suited for web development. Therefore, it is used to develop web applications (an application that executes on the server and generates the dynamic page.).PHP was created by Rasmus Lerdorf in 1994 but appeared in the market in 1995. Some important points need to be noticed about PHP are as followed:\r\n\r\nPHP stands for Hypertext Preprocessor.\r\nPHP is an interpreted language, i.e., there is no need for compilation.\r\nPHP is faster than other scripting languages, for example, ASP and JSP.\r\nPHP is a server-side scripting language, which is used to manage the dynamic content of the website.\r\nPHP can be embedded into HTML.\r\nPHP is an object-oriented language.\r\nPHP is an open-source scripting language.\r\nPHP is simple and easy to learn language."},{"_id":"p2","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"Advantages of PHP over other languages","bio":"If you're familiar with other server-side languages like ASP.NET or Java, you might be wondering what makes PHP so special. There are several advantages why one should choose PHP.\r\n\r\nEasy to learn: PHP is easy to learn and use. For beginner programmers who just started out in web development, PHP is often considered as the preferable choice of language to learn.\r\nOpen source: PHP is an open-source project. It is developed and maintained by a worldwide community of developers who make its source code freely available to download and use.\r\nPortability: PHP runs on various platforms such as Microsoft Windows, Linux, Mac OS, etc. and it is compatible with almost all servers used today such Apache, IIS, etc.\r\nFast Performance: Scripts written in PHP usually execute or runs faster than those written in other scripting languages like ASP, Ruby, Python, Java, etc.\r\nVast Community: Since PHP is supported by the worldwide community, finding help or documentation related to PHP online is extremely easy."},{"_id":"p3","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"Setting up local web server for PHP","bio":"PHP script execute on a web server running PHP. So before you start writing any PHP program you need the following program installed on your computer.\r\n\r\nThe Apache Web server\r\nThe PHP engine\r\nThe MySQL database server\r\nYou can either install them individually or choose a pre-configured package for your operating system like Linux and Windows. Popular pre-configured package are XAMPP and WampServer.\r\n\r\nWampServer is a Windows web development environment. It allows you to create web applications with Apache2, PHP and a MySQL database. It will also provide the MySQL administrative tool PhpMyAdmin to easily manage your databases using a web browser."},{"_id":"p4","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"First PHP Script ","bio":"Now that you have successfully installed WampServer on your computer. In this section we will create a very simple PHP script that displays the text \"Hello, world!\" in the browser window.\r\n\r\nOk, click on the WampServer icon somewhere on your Windows task bar and select the \"www directory\". Alternatively, you can access the \"www\" directory through navigating the C:\\wamp\\www. Create a subdirectory in \"www\" directory let's say \"project\".\r\n\r\nNow open up your favorite code editor and create a new PHP file then type the following code:\r\n\r\nExample\r\n\r\n<?php\r\n// Display greeting message\r\necho \"Hello, world!\";\r\n?>\r\n\r\nNow save this file as \"hello.php\" in your project folder (located at C:\\wamp\\www\\project), and view the result in your browser through visiting this URL: http://localhost/project/hello.php.\r\n\r\nAlternatively, you can access the \"hello.php\" file through selecting the localhost option and then select the project folder from the WampSever menu on the taskbar"},{"_id":"p5","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"Standard PHP Syntax","bio":"A PHP script starts with the <?php and ends with the ?> tag.\r\n\r\nThe PHP delimiter <?php and ?> in the following example simply tells the PHP engine to treat the enclosed code block as PHP code, rather than simple HTML.\r\n\r\nExample\r\n\r\n<?php\r\n// Some code to be executed\r\necho \"Hello, world!\";\r\n?>\r\n\r\nEvery PHP statement end with a semicolon (;) — this tells the PHP engine that the end of the current statement has been reached."},{"_id":"p6","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"Variable in PHP","bio":"Variables are used to store data, like string of text, numbers, etc. Variable values can change over the course of a script. Here're some important things to know about variables:\r\n\r\nIn PHP, a variable does not need to be declared before adding a value to it. PHP automatically converts the variable to the correct data type, depending on its value.\r\nAfter declaring a variable it can be reused throughout the code.\r\nThe assignment operator (=) used to assign value to a variable.\r\nIn PHP variable can be declared as: $var_name = value;"},{"_id":"p7","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"PHP echo","bio":"PHP echo is a language construct, not a function. Therefore, you don't need to use parenthesis with it. But if you want to use more than one parameter, it is required to use parenthesis.\r\n\r\nThe syntax of PHP echo is given below:\r\n\r\nvoid echo ( string $arg1 [, string $... ] )  \r\n\r\nPHP echo statement can be used to print the string, multi-line strings, escaping characters, variable, array, etc. Some important points that you must know about the echo statement are:\r\n\r\necho is a statement, which is used to display the output.\r\necho can be used with or without parentheses: echo(), and echo.\r\necho does not return any value.\r\nWe can pass multiple strings separated by a comma (,) in echo.\r\necho is faster than the print statement.\r\n\r\nPHP echo: printing string\r\n\r\nFile: echo1.php\r\n\r\n<?php  \r\necho \"Hello by PHP echo\";  \r\n?>  "},{"_id":"p8","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"PHP echo vs print","bio":"echo\r\n\r\necho is a statement, which is used to display the output.\r\necho can be used with or without parentheses.\r\necho does not return any value.\r\nWe can pass multiple strings separated by comma (,) in echo.\r\necho is faster than print statement.\r\n\r\nprint\r\n\r\nprint is also a statement, used as an alternative to echo at many times to display the output.\r\nprint can be used with or without parentheses.\r\nprint always returns an integer value, which is 1.\r\nUsing print, we cannot pass multiple arguments.\r\nprint is slower than echo statement."},{"_id":"p9","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"PHP Variable and rules","bio":"In PHP, a variable is declared using a $ sign followed by the variable name. Here, some important points to know about variables:\r\n\r\nAs PHP is a loosely typed language, so we do not need to declare the data types of the variables. It automatically analyzes the values and makes conversions to its correct datatype.\r\nAfter declaring a variable, it can be reused throughout the code.\r\nAssignment Operator (=) is used to assign the value to a variable.\r\nSyntax of declaring a variable in PHP is given below:\r\n\r\n$variablename=value;  \r\n\r\nRules for declaring PHP variable:\r\n\r\nA variable must start with a dollar ($) sign, followed by the variable name.\r\nIt can only contain alpha-numeric character and underscore (A-z, 0-9, _).\r\nA variable name must start with a letter or underscore (_) character.\r\nA PHP variable name cannot contain spaces.\r\nOne thing to be kept in mind that the variable name cannot start with a number or special symbols.\r\nPHP variables are case-sensitive, so $name and $NAME both are treated as different variable."},{"_id":"p10","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/php_icon-1-scaled.jpg","name":"PHP $ and $$","bio":"The $var (single dollar) is a normal variable with the name var that stores any value like string, integer, float, etc.\r\n\r\nThe $$var (double dollar) is a reference variable that stores the value of the $variable inside it.\r\nTo understand the difference better, let's see some examples.\r\n\r\nExample 1\r\n\r\n<?php  \r\n$x = \"abc\";  \r\n$$x = 200;  \r\necho $x.\"<br/>\";  \r\necho $$x.\"<br/>\";  \r\necho $abc;  \r\n?>  "}]