[{"_id":"d1","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"What is Database?","bio":"It is very important to understand the database before learning MySQL. A database is an application that stores the organized collection of records. It can be accessed and manage by the user very easily. It allows us to organize data into tables, rows, columns, and indexes to find the relevant information very quickly. Each database contains distinct API for performing database operations such as creating, managing, accessing, and searching the data it stores. Today, many databases available like MySQL, Sybase, Oracle, MongoDB, PostgreSQL, SQL Server, etc. In this section, we are going to focus on MySQL mainly."},{"_id":"d2","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"What is MySQL?","bio":"MySQL is currently the most popular database management system software used for managing the relational database. It is open-source database software, which is supported by Oracle Company. It is fast, scalable, and easy to use database management system in comparison with Microsoft SQL Server and Oracle Database. It is commonly used in conjunction with PHP scripts for creating powerful and dynamic server-side or web-based enterprise applications.\r\n\r\nIt is developed, marketed, and supported by MySQL AB, a Swedish company, and written in C programming language and C++ programming language. The official pronunciation of MySQL is not the My Sequel; it is My Ess Que Ell. However, you can pronounce it in your way. Many small and big companies use MySQL. MySQL supports many Operating Systems like Windows, Linux, MacOS, etc. with C, C++, and Java languages.\r\n\r\nMySQL is a Relational Database Management System (RDBMS) software that provides many things, which are as follows:\r\n\r\n1.It allows us to implement database operations on tables, rows, columns, and indexes.\r\n2.It defines the database relationship in the form of tables (collection of rows and columns), also known as relations.\r\n3.It provides the Referential Integrity between rows or columns of various tables.\r\n4.It allows us to updates the table indexes automatically.\r\n5.It uses many SQL queries and combines useful information from multiple tables for the end-users."},{"_id":"d3","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"How MySQL Works?","bio":"MySQL follows the working of Client-Server Architecture. This model is designed for the end-users called clients to access the resources from a central computer known as a server using network services. Here, the clients make requests through a graphical user interface (GUI), and the server will give the desired output as soon as the instructions are matched. The process of MySQL environment is the same as the client-server model.\r\n\r\nMySQL\r\nThe core of the MySQL database is the MySQL Server. This server is available as a separate program and responsible for handling all the database instructions, statements, or commands. The working of MySQL database with MySQL Server are as follows:\r\n\r\n1.MySQL creates a database that allows you to build many tables to store and manipulate data and defining the relationship between each table.\r\n2.Clients make requests through the GUI screen or command prompt by using specific SQL expressions on MySQL.\r\n3.Finally, the server application will respond with the requested expressions and produce the desired result on the client-side.\r\n\r\nA client can use any MySQL GUI. But, it is making sure that your GUI should be lighter and user-friendly to make your data management activities faster and easier. Some of the most widely used MySQL GUIs are MySQL Workbench, SequelPro, DBVisualizer, and the Navicat DB Admin Tool. Some GUIs are commercial, while some are free with limited functionality, and some are only compatible with MacOS. Thus, you can choose the GUI according to your needs."},{"_id":"d4","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"Install MySQL on windows?","bio":"The default installation on any version of Windows is now much easier than it used to be, as MySQL now comes neatly packaged with an installer. Simply download the installer package, unzip it anywhere and run the setup.exe file.\r\n\r\nThe default installer setup.exe will walk you through the trivial process and by default will install everything under C:\\mysql.\r\n\r\nTest the server by firing it up from the command prompt the first time. Go to the location of the mysqld server which is probably \r\nC:\\mysql\\bin, and type −\r\n\r\nmysqld.exe --console\r\n\r\nNOTE − If you are on NT, then you will have to use mysqld-nt.exe instead of mysqld.exe\r\n\r\nIf all went well, you will see some messages about startup and InnoDB. If not, you may have a permissions issue. Make sure that the directory that holds your data is accessible to whatever user (probably MySQL) the database processes run under.\r\n\r\nMySQL will not add itself to the start menu, and there is no particularly nice GUI way to stop the server either. Therefore, if you tend to start the server by double clicking the mysqld executable, you should remember to halt the process by hand by using mysqladmin, Task List, Task Manager, or other Windows-specific means"},{"_id":"d5","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"Install MySQL on Linux?","bio":"The recommended way to install MySQL on a Linux system is via RPM. MySQL AB makes the following RPMs available for download on its website −\r\n\r\nMySQL − The MySQL database server manages the databases and tables, controls user access and processes the SQL queries.\r\n\r\nMySQL-client − MySQL client programs, which make it possible to connect to and interact with the server.\r\n\r\nMySQL-devel − Libraries and header files that come in handy when compiling other programs that use MySQL.\r\n\r\nMySQL-shared − Shared libraries for the MySQL client.\r\n\r\nMySQL-bench − Benchmark and performance testing tools for the MySQL database server.\r\n\r\nThe MySQL RPMs listed here are all built on a SuSE Linux system, but they will usually work on other Linux variants with no difficulty.\r\n\r\nNow, you will need to adhere to the steps given below, to proceed with the installation −\r\n\r\nLogin to the system using the root user.\r\n\r\nSwitch to the directory containing the RPMs.\r\n\r\nInstall the MySQL database server by executing the following command. Remember to replace the filename in italics with the file name of your RPM.\r\n\r\n[root@host]# rpm -i MySQL-5.0.9-0.i386.rpm\r\n\r\nThe above command takes care of installing the MySQL server, creating a user of MySQL, creating necessary configuration and starting the MySQL server automatically.\r\n\r\nYou can find all the MySQL related binaries in /usr/bin and /usr/sbin. All the tables and databases will be created in the /var/lib/mysql directory.\r\n\r\nThe following code box has an optional but recommended step to install the remaining RPMs in the same manner −\r\n\r\n[root@host]# rpm -i MySQL-client-5.0.9-0.i386.rpm\r\n[root@host]# rpm -i MySQL-devel-5.0.9-0.i386.rpm\r\n[root@host]# rpm -i MySQL-shared-5.0.9-0.i386.rpm\r\n[root@host]# rpm -i MySQL-bench-5.0.9-0.i386.rpm"},{"_id":"d6","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"What is ReactJS?","bio":"After MySQL, has been successfully installed, the base tables have been initialized and the server has been started: you can verify that everything is working as it should be via some simple tests.\r\n\r\nUse the mysqladmin Utility to Obtain Server Status\r\nUse mysqladmin binary to check the server version. This binary would be available in /usr/bin on linux and in C:\\mysql\\bin on windows.\r\n\r\n[root@host]# mysqladmin --version\r\n\r\nIt will produce the following result on Linux. It may vary depending on your installation −\r\n\r\nmysqladmin  Ver 8.23 Distrib 5.0.9-0, for redhat-linux-gnu on i386\r\n\r\nIf you do not get such a message, then there may be some problem in your installation and you would need some help to fix it.\r\n\r\nExecute simple SQL commands using the MySQL Client\r\nYou can connect to your MySQL server through the MySQL client and by using the mysql command. At this moment, you do not need to give any password as by default it will be set as blank.\r\n\r\nYou can just use following command −\r\n\r\n[root@host]# mysql\r\n\r\nIt should be rewarded with a mysql> prompt. Now, you are connected to the MySQL server"},{"_id":"d7","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"Verifying MySQL Installation","bio":"After MySQL, has been successfully installed, the base tables have been initialized and the server has been started: you can verify that everything is working as it should be via some simple tests.\r\n\r\nUse the mysqladmin Utility to Obtain Server Status\r\nUse mysqladmin binary to check the server version. This binary would be available in /usr/bin on linux and in C:\\mysql\\bin on windows.\r\n\r\n[root@host]# mysqladmin --version\r\n\r\nIt will produce the following result on Linux. It may vary depending on your installation −\r\n\r\nmysqladmin  Ver 8.23 Distrib 5.0.9-0, for redhat-linux-gnu on i386\r\n\r\nIf you do not get such a message, then there may be some problem in your installation and you would need some help to fix it.\r\n\r\nExecute simple SQL commands using the MySQL Client\r\nYou can connect to your MySQL server through the MySQL client and by using the mysql command. At this moment, you do not need to give any password as by default it will be set as blank.\r\n\r\nYou can just use following command −\r\n\r\n[root@host]# mysql\r\n\r\nIt should be rewarded with a mysql> prompt. Now, you are connected to the MySQL server"},{"_id":"d8","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"Running and Shutting down MySQL Server","bio":"First check if your MySQL server is running or not. You can use the following command to check it −\r\n\r\nps -ef | grep mysqld\r\n\r\nIf your MySql is running, then you will see mysqld process listed out in your result. If server is not running, then you can start it by using the following command −\r\n\r\nroot@host# cd /usr/bin\r\n./safe_mysqld &\r\n\r\nNow, if you want to shut down an already running MySQL server, then you can do it by using the following command −\r\n\r\nroot@host# cd /usr/bin\r\n./mysqladmin -u root -p shutdown\r\nEnter password: ******"},{"_id":"d9","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"MySQL Workbench","bio":"MySQL Workbench is a unified visual database designing or graphical user interface tool used for working with database architects, developers, and Database Administrators. It is developed and maintained by Oracle. It provides SQL development, data modeling, data migration, and comprehensive administration tools for server configuration, user administration, backup, and many more. We can use this Server Administration for creating new physical data models, E-R diagrams, and for SQL development (run queries, etc.). It is available for all major operating systems like Mac OS, Windows, and Linux. MySQL Workbench fully supports MySQL Server version v5.6 and higher.\r\n\r\nMySQL Workbench covers five main functionalities, which are given below:\r\n\r\nSQL Development: This functionality provides the capability that enables you to execute SQL queries, create and manage connections to the database Servers with the help of built-in SQL editor.\r\n\r\n\r\nData Modelling (Design): This functionality provides the capability that enables you to create models of the database Schema graphically, performs reverse and forward engineering between a Schema and a live database, and edit all aspects of the database using the comprehensive Table editor. The Table editor gives the facilities for editing tables, columns, indexes, views, triggers, partitioning, etc.\r\n\r\nServer Administration: This functionality enables you to administer MySQL Server instances by administering users, inspecting audit data, viewing database health, performing backup and recovery, and monitoring the performance of MySQL Server.\r\n\r\nData Migration: This functionality allows you to migrate from Microsoft SQL Server, SQLite, Microsoft Access, PostgreSQL, Sybase ASE, SQL Anywhere, and other RDBMS tables, objects, and data to MySQL. It also supports migrating from the previous versions of MySQL to the latest releases.\r\n\r\nMySQL Enterprise Supports: This functionality gives the support for Enterprise products such as MySQL firewall, MySQL Enterprise Backup, and MySQL Audit."},{"_id":"d10","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"MySQL Connection Using MySQL Binary","bio":"You can establish the MySQL database using the mysql binary at the command prompt.\r\n\r\nExample\r\nHere is a simple example to connect to the MySQL server from the command prompt −\r\n\r\n[root@host]# mysql -u root -p\r\nEnter password:******\r\nThis will give you the mysql> command prompt where you will be able to execute any SQL command. Following is the result of above command −\r\n\r\nThe following code block shows the result of above code −\r\n\r\nWelcome to the MySQL monitor.  Commands end with ; or \\g.\r\nYour MySQL connection id is 2854760 to server version: 5.0.9\r\n\r\nType 'help;' or '\\h' for help. Type '\\c' to clear the buffer.\r\nIn the above example, we have used root as a user but you can use any other user as well. Any user will be able to perform all the SQL operations, which are allowed to that user.\r\n\r\nYou can disconnect from the MySQL database any time using the exit command at mysql> prompt.\r\n\r\nmysql> exit\r\nBye"},{"_id":"d10","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/mysql-scaled.jpg","name":"Create Database by MySQL CLI","bio":"We can create a new database in MySQL by using the CREATE DATABASE statement with the below syntax:\r\n\r\n\r\nCREATE DATABASE [IF NOT EXISTS] database_name  \r\n[CHARACTER SET charset_name]  \r\n[COLLATE collation_name];  \r\n\r\nExample\r\n\r\nLet us understand how to create a database in MySQL with the help of an example. Open the MySQL console and write down the password, if we have set during installation. Now we are ready to create a database. Here, we are going to create a database name \"employeedb\" using the following statement:\r\n\r\nmysql> CREATE DATABASE employeesdb;\r\n\r\nWe can review the newly created database using the below query that returns the database name, character set, and collation of the database:\r\n\r\nmysql> SHOW CREATE DATABASE employeedb;   \r\n\r\nWe can check the created database using the following query:\r\n\r\nmysql> SHOW DATABASES;    \r\n\r\nAfter executing the above query, we can see all the created databases in the server.\r\n\r\nFinally, we can use the below command to access the database that enables us to create a table and other database objects.\r\n\r\nmysql> USE emplyeedb;   "}]