[{"_id":"w1","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"What is Python?","bio":"Python is a general purpose, dynamic, high-level, and interpreted programming language. It supports Object Oriented programming approach to develop applications. It is simple and easy to learn and provides lots of high-level data structures.\r\n\r\nPython is easy to learn yet powerful and versatile scripting language, which makes it attractive for Application Development.\r\n\r\nPython's syntax and dynamic typing with its interpreted nature make it an ideal language for scripting and rapid application development.\r\n\r\nPython supports multiple programming pattern, including object-oriented, imperative, and functional or procedural programming styles.\r\n\r\nPython is not intended to work in a particular area, such as web programming. That is why it is known as multipurpose programming language because it can be used with web, enterprise, 3D CAD, etc.\r\n\r\nWe don't need to use data types to declare variable because it is dynamically typed so we can write a=10 to assign an integer value in an integer variable.\r\n\r\nPython makes the development and debugging fast because there is no compilation step included in Python development, and edit-test-debug cycle is very fast."},{"_id":"w2","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Python 2 vs Python 3","bio":"In most of the programming languages, whenever a new version releases, it supports the features and syntax of the existing version of the language, therefore, it is easier for the projects to switch in the newer version. However, in the case of Python, the two versions Python 2 and Python 3 are very much different from each other.\r\n\r\nA list of differences between Python 2 and Python 3 are given below:\r\n\r\n1.Python 2 uses print as a statement and used as print \"something\" to print some string on the console. On the other hand, Python 3 uses print as a function and used as print(\"something\") to print something on the console.\r\n2.Python 2 uses the function raw_input() to accept the user's input. It returns the string representing the value, which is typed by the user. To convert it into the integer, we need to use the int() function in Python. On the other hand, Python 3 uses input() function which automatically interpreted the type of input entered by the user. However, we can cast this value to any type by using primitive functions (int(), str(), etc.).\r\n3.In Python 2, the implicit string type is ASCII, whereas, in Python 3, the implicit string type is Unicode.\r\n4.Python 3 doesn't contain the xrange() function of Python 2. The xrange() is the variant of range() function which returns a xrange object that works similar to Java iterator. The range() returns a list for example the function range(0,3) contains 0, 1, 2.\r\n5.There is also a small change made in Exception handling in Python 3. It defines a keyword as which is necessary to be used. We will discuss it in Exception handling section of Python programming tutorial."},{"_id":"w3","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Features of Python","bio":"Python's features include −\r\n\r\nEasy-to-learn − Python has few keywords, simple structure, and a clearly defined syntax. This allows the student to pick up the language quickly.\r\n\r\nEasy-to-read − Python code is more clearly defined and visible to the eyes.\r\n\r\nEasy-to-maintain − Python's source code is fairly easy-to-maintain.\r\n\r\nA broad standard library − Python's bulk of the library is very portable and cross-platform compatible on UNIX, Windows, and Macintosh.\r\n\r\nInteractive Mode − Python has support for an interactive mode which allows interactive testing and debugging of snippets of code.\r\n\r\nPortable − Python can run on a wide variety of hardware platforms and has the same interface on all platforms.\r\n\r\nExtendable − You can add low-level modules to the Python interpreter. These modules enable programmers to add to or customize their tools to be more efficient.\r\n\r\nDatabases − Python provides interfaces to all major commercial databases.\r\n\r\nGUI Programming − Python supports GUI applications that can be created and ported to many system calls, libraries and windows systems, such as Windows MFC, Macintosh, and the X Window system of Unix.\r\n\r\nScalable − Python provides a better structure and support for large programs than shell scripting."},{"_id":"w4","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Install Python on windows","bio":"Here are the steps to install Python on Windows machine.\r\n\r\nOpen a Web browser and go to https://www.python.org/downloads/.\r\n\r\nFollow the link for the Windows installer python-XYZ.msi file where XYZ is the version you need to install.\r\n\r\nTo use this installer python-XYZ.msi, the Windows system must support Microsoft Installer 2.0. Save the installer file to your local machine and then run it to find out if your machine supports MSI.\r\n\r\nRun the downloaded file. This brings up the Python install wizard, which is really easy to use. Just accept the default settings, wait until the install is finished, and you are done."},{"_id":"w5","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Python first program","bio":"Let us execute programs in different modes of programming.\r\n\r\nInteractive Mode Programming\r\nInvoking the interpreter without passing a script file as a parameter brings up the following prompt −\r\n\r\n$ python\r\nPython 2.4.3 (#1, Nov 11 2010, 13:34:43)\r\n[GCC 4.1.2 20080704 (Red Hat 4.1.2-48)] on linux2\r\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\r\n>>>\r\nType the following text at the Python prompt and press the Enter −\r\n\r\n>>> print \"Hello, Python!\"\r\nIf you are running new version of Python, then you would need to use print statement with parenthesis as in print (\"Hello, Python!\");.\r\n\r\nScript Mode Programming\r\n\r\nInvoking the interpreter with a script parameter begins execution of the script and continues until the script is finished. When the script is finished, the interpreter is no longer active.\r\n\r\nLet us write a simple Python program in a script. Python files have extension .py. Type the following source code in a test.py file −\r\n\r\nprint \"Hello, Python!\"\r\nWe assume that you have Python interpreter set in PATH variable. Now, try to run this program as follows −\r\n\r\n$ python test.py"},{"_id":"w6","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Assigning values to variables","bio":"Python variables do not need explicit declaration to reserve memory space. The declaration happens automatically when you assign a value to a variable. The equal sign (=) is used to assign values to variables.\r\n\r\nThe operand to the left of the = operator is the name of the variable and the operand to the right of the = operator is the value stored in the variable. For example −\r\n\r\n#!/usr/bin/python\r\n\r\ncounter = 100          # An integer assignment\r\nmiles   = 1000.0       # A floating point\r\nname    = \"John\"       # A string\r\n\r\nprint counter\r\nprint miles\r\nprint name\r\nHere, 100, 1000.0 and \"John\" are the values assigned to counter, miles, and name variables, respectively. This produces the following result −\r\n\r\n100\r\n1000.0\r\nJohn\r\n\r\nMultiple Assignment\r\n\r\nPython allows you to assign a single value to several variables simultaneously. For example −\r\n\r\na = b = c = 1\r\nHere, an integer object is created with the value 1, and all three variables are assigned to the same memory location. You can also assign multiple objects to multiple variables. For example −\r\n\r\na,b,c = 1,2,\"john\"\r\nHere, two integer objects with values 1 and 2 are assigned to variables a and b respectively, and one string object with the value \"john\" is assigned to the variable c."},{"_id":"w7","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Python Data Type","bio":"In programming, data type is an important concept.\r\n\r\nVariables can store data of different types, and different types can do different things.\r\n\r\nPython has the following data types built-in by default, in these categories:\r\n\r\nText Type:\tstr\r\nNumeric Types:\tint, float, complex\r\nSequence Types:\tlist, tuple, range\r\nMapping Type:\tdict\r\nSet Types:\tset, frozenset\r\nBoolean Type:\tbool\r\nBinary Types:\tbytes, bytearray, memoryview"},{"_id":"w8","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Operators in Python","bio":"The operator can be defined as a symbol which is responsible for a particular operation between two operands. Operators are the pillars of a program on which the logic is built in a specific programming language. Python provides a variety of operators, which are described as follows.\r\n\r\nArithmetic operators\r\nComparison operators\r\nAssignment Operators\r\nLogical Operators\r\nBitwise Operators\r\nMembership Operators\r\nIdentity Operators\r\n\r\n"},{"_id":"w9","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Python Collections (Arrays)","bio":"There are four collection data types in the Python programming language:\r\n\r\nList is a collection which is ordered and changeable. Allows duplicate members.\r\nTuple is a collection which is ordered and unchangeable. Allows duplicate members.\r\nSet is a collection which is unordered and unindexed. No duplicate members.\r\nDictionary is a collection which is unordered, changeable and indexed. No duplicate members.\r\nWhen choosing a collection type, it is useful to understand the properties of that type. Choosing the right type for a particular data set could mean retention of meaning, and, it could mean an increase in efficiency or security.\r\n\r\nList\r\nA list is a collection which is ordered and changeable. In Python lists are written with square brackets.\r\n\r\nExample\r\nCreate a List:\r\n\r\nthislist = [\"apple\", \"banana\", \"cherry\"]\r\nprint(thislist)\r\n\r\nTuple\r\nA tuple is a collection which is ordered and unchangeable. In Python tuples are written with round brackets.\r\n\r\nExample\r\nCreate a Tuple:\r\n\r\nthistuple = (\"apple\", \"banana\", \"cherry\")\r\nprint(thistuple)\r\n\r\nSet\r\nA set is a collection which is unordered and unindexed. In Python sets are written with curly brackets.\r\n\r\nExample\r\nCreate a Set:\r\n\r\nthisset = {\"apple\", \"banana\", \"cherry\"}\r\nprint(thisset)\r\n\r\nDictionary\r\nA dictionary is a collection which is unordered, changeable and indexed. In Python dictionaries are written with curly brackets, and they have keys and values.\r\n\r\nExample\r\nCreate and print a dictionary:\r\n\r\nthisdict = {\r\n  \"brand\": \"Ford\",\r\n  \"model\": \"Mustang\",\r\n  \"year\": 1964\r\n}\r\nprint(thisdict)"},{"_id":"w10","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/python_logo-scaled.jpg","name":"Python Functions","bio":"A function is a block of code which only runs when it is called.\r\nYou can pass data, known as parameters, into a function.\r\nA function can return data as a result.\r\n\r\nCreating a Function\r\nIn Python a function is defined using the def keyword:\r\n\r\nExample\r\ndef my_function():\r\n  print(\"Hello from a function\")\r\nCalling a Function\r\nTo call a function, use the function name followed by parenthesis:\r\n\r\nExample\r\ndef my_function():\r\n  print(\"Hello from a function\")\r\n\r\nmy_function()\r\n"}]