[{"_id":"b1","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"What is JavaScript?","bio":"JavaScript (js) is a light-weight object-oriented programming language which is used by several websites for scripting the webpages. It is an interpreted, full-fledged programming language that enables dynamic interactivity on websites when applied to an HTML document. It was introduced in the year 1995 for adding programs to the webpages in the Netscape Navigator browser. Since then, it has been adopted by all other graphical web browsers. With JavaScript, users can build modern web applications to interact directly without reloading the page every time. The traditional website uses js to provide several forms of interactivity and simplicity.\r\n\r\nAlthough, JavaScript has no connectivity with Java programming language. The name was suggested and provided in the times when Java was gaining popularity in the market. In addition to web browsers, databases such as CouchDB and MongoDB uses JavaScript as their scripting and query language."},{"_id":"b2","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"Features of JavaScript","bio":"There are following features of JavaScript:\r\n\r\n1.All popular web browsers support JavaScript as they provide built-in execution environments.\r\n2.JavaScript follows the syntax and structure of the C programming language. Thus, it is a structured programming language.\r\n3.JavaScript is a weakly typed language, where certain types are implicitly cast (depending on the operation).\r\n4.JavaScript is an object-oriented programming language that uses prototypes rather than using classes for inheritance.\r\n5.It is a light-weighted and interpreted language.\r\n6.It is a case-sensitive language.\r\n7.JavaScript is supportable in several operating systems including, Windows, macOS, etc.\r\n8.It provides good control to the users over the web browsers."},{"_id":"b3","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"External JavaScript file","bio":"We can create external JavaScript file and embed it in many html page.\r\nIt provides code re usability because single JavaScript file can be used in several html pages.\r\nAn external JavaScript file must be saved by .js extension. It is recommended to embed all JavaScript files into a single file. It increases the speed of the webpage.\r\n\r\nLet's create an external JavaScript file that prints Hello Javatpoint in a alert dialog box.\r\n\r\nmessage.js\r\n\r\nfunction msg(){  \r\n alert(\"Hello Javatpoint\");  \r\n}  \r\n\r\nLet's include the JavaScript file into html page. It calls the JavaScript function on button click.\r\nindex.html\r\n\r\n<html>  \r\n<head>  \r\n<script type=\"text/javascript\" src=\"message.js\"></script>  \r\n</head>  \r\n<body>  \r\n<p>Welcome to JavaScript</p>  \r\n<form>  \r\n<input type=\"button\" value=\"click\" onclick=\"msg()\"/>  \r\n</form>  \r\n</body>  \r\n</html>"},{"_id":"b4","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"Advantage of External JavaScript file","bio":"Advantages of External JavaScript\r\nThere will be following benefits if a user creates an external javascript:\r\n\r\n1.It helps in the reusability of code in more than one HTML file.\r\n2.It allows easy code readability.\r\n3.It is time-efficient as web browsers cache the external js files, which further reduces the page loading time.\r\n4.It enables both web designers and coders to work with html and js files parallelly and separately, i.e., without facing any code conflictions.\r\n5.The length of the code reduces as only we need to specify the location of the js file."},{"_id":"b5","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"Disadvantage of External JavaScript file","bio":"There are the following disadvantages of external files:\r\n\r\n1.The stealer may download the coder's code using the url of the js file.\r\n2.If two js files are dependent on one another, then a failure in one file may affect the execution of the other dependent file.\r\n3.The web browser needs to make an additional http request to get the js code.\r\n4.A tiny to a large change in the js code may cause unexpected results in all its dependent files.\r\n5.We need to check each file that depends on the commonly created external javascript file.\r\n6.If it is a few lines of code, then better to implement the internal javascript code."},{"_id":"b6","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"What is BOM?","bio":"BOM stands for Browser Object Model. It provides interaction with the browser. The default object of a browser is a window. So, you can call all the functions of the window by specifying the window or directly. The window object provides various properties like document, history, screen, navigator, location, innerHeight, innerWidth,"},{"_id":"b7","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"What is the use of history object?","bio":"The history object of a browser can be used to switch to history pages such as back and forward from the current page or another page. There are three methods of history object.\r\n\r\nhistory.back() - It loads the previous page.\r\nhistory.forward() - It loads the next page.\r\nhistory.go(number) - The number may be positive for forward, negative for backward. It loads the given page number."},{"_id":"b8","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"How to write a comment in JavaScript?","bio":"There are two types of comments in JavaScript.\r\n\r\n1.Single Line Comment: It is represented by // (double forward slash)\r\n2.Multi-Line Comment: Slash represents it with asterisk symbol as /* write comment here */"},{"_id":"b9","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"Difference between Client side JavaScript and Server side JavaScript?","bio":"Client-side JavaScript comprises the basic language and predefined objects which are relevant to running JavaScript in a browser. The client-side JavaScript is embedded directly by in the HTML pages. The browser interprets this script at runtime.\r\n\r\nServer-side JavaScript also resembles client-side JavaScript. It has a relevant JavaScript which is to run in a server. The server-side JavaScript are deployed only after compilation."},{"_id":"b10","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"JavaScript Objects","bio":"A javaScript object is an entity having state and behavior (properties and method). For example: car, pen, bike, chair, glass, keyboard, monitor etc.\r\n\r\nJavaScript is an object-based language. Everything is an object in JavaScript.\r\n\r\nJavaScript is template based not class based. Here, we don't create class to get the object. But, we direct create objects.\r\n\r\nThere are 3 ways to create objects.\r\n\r\n1.By object literal\r\n2.By creating instance of Object directly (using new keyword)\r\n3.By using an object constructor (using new keyword)\r\n\r\n1) JavaScript Object by object literal\r\nThe syntax of creating object using object literal is given below:\r\n\r\nobject={property1:value1,property2:value2.....propertyN:valueN}  \r\n\r\n2) By creating instance of Object\r\nThe syntax of creating object directly is given below:\r\n\r\nvar objectname=new Object();  \r\n\r\nBy using an Object constructor\r\nHere, you need to create function with arguments. Each argument value can be assigned in the current object by using this keyword.\r\n\r\nThe this keyword refers to the current object."},{"_id":"b11","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"JavaScript Array","bio":"JavaScript array is an object that represents a collection of similar type of elements.\r\n\r\nThere are 3 ways to construct array in JavaScript\r\n1.By array literal\r\n2.By creating instance of Array directly (using new keyword)\r\n3.By using an Array constructor (using new keyword)\r\n1) JavaScript array literal\r\nThe syntax of creating array using array literal is given below:\r\n\r\nvar arrayname=[value1,value2.....valueN];  \r\n\r\n2) JavaScript Array directly (new keyword)\r\nThe syntax of creating array directly is given below:\r\n\r\nvar arrayname=new Array();  \r\nHere, new keyword is used to create instance of array.\r\n\r\n3) JavaScript array constructor (new keyword)\r\nHere, you need to create instance of array by passing arguments in constructor so that we don't have to provide value explicitly.\r\n\r\nThe example of creating object by array constructor is given below.\r\n\r\n<script>  \r\nvar emp=new Array(\"Jai\",\"Vijay\",\"Smith\");  \r\nfor (i=0;i<emp.length;i++){  \r\ndocument.write(emp[i] + \"<br>\");  \r\n}  \r\n</script>  "},{"_id":"b12","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/1-scaled.jpg","name":"JavaScript String","bio":"The JavaScript string is an object that represents a sequence of characters.\r\n\r\nThere are 2 ways to create string in JavaScript\r\n\r\n1.By string literal\r\n2.By string object (using new keyword)\r\n1) By string literal\r\nThe string literal is created using double quotes. The syntax of creating string using string literal is given below:\r\n\r\nvar stringname=\"string value\";  \r\n\r\n2) By string object (using new keyword)\r\nThe syntax of creating string object using new keyword is given below:\r\n\r\nvar stringname=new String(\"string literal\");  \r\nHere, new keyword is used to create instance of string."}]