[{"_id":"d1","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"What is C?","bio":"C language Tutorial with programming approach for beginners and professionals, helps you to understand the C language tutorial easily. Our C tutorial explains each topic with programs.\r\n\r\nThe C Language is developed by Dennis Ritchie for creating system applications that directly interact with the hardware devices such as drivers, kernels, etc.\r\n\r\nC programming is considered as the base for other programming languages, that is why it is known as mother language.\r\n\r\n\r\nIt can be defined by the following ways:\r\n\r\nMother language\r\nSystem programming language\r\nProcedure-oriented programming language\r\nStructured programming language\r\nMid-level programming language"},{"_id":"d2","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"Features of c","bio":"C is the widely used language. It provides many features that are given below.\r\n\r\nSimple\r\nMachine Independent or Portable\r\nMid-level programming language\r\nstructured programming language\r\nRich Library\r\nMemory Management\r\nFast Speed\r\nPointers\r\nRecursion\r\nExtensible"},{"_id":"d3","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"Install c","bio":"There are many compilers available for c and c++. You need to download any one. Here, we are going to use Turbo C++. It will work for both C and C++. To install the Turbo C software, you need to follow following steps.\r\n\r\nDownload Turbo C++\r\nCreate turboc directory inside c drive and extract the tc3.zip inside c:\\turboc\r\nDouble click on install.exe file\r\nClick on the tc application file located inside c:\\TC\\BIN to write the c program\r\n1) Download Turbo C++ software\r\nYou can download turbo c++ from many sites. download Turbo c++\r\n\r\n2) Create turboc directory in c drive and extract the tc3.zip\r\nNow, you need to create a new directory turboc inside the c: drive. Now extract the tc3.zip file in c:\\truboc directory.\r\n\r\n\r\n3) Double click on the install.exe file and follow steps\r\nNow, click on the install icon located inside the c:\\turboc\r\n\r\nIt will ask you to install c or not, press enter to install.\r\n\r\nChange your drive to c, press c.\r\n\r\nPress enter, it will look inside the c:\\turboc directory for the required files.\r\n\r\nSelect Start installation by the down arrow key then press enter.\r\n\r\nNow C is installed, press enter to read documentation or close the software. how to install turbo c\r\n\r\n4) Click on the tc application located inside c:\\TC\\BIN\r\nNow double click on the tc icon located in c:\\TC\\BIN directory to write the c program."},{"_id":"d4","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"c first program","bio":"Before starting the abcd of C language, you need to learn how to write, compile and run the first c program.\r\n\r\nTo write the first c program, open the C console and write the following code:\r\n\r\n#include <stdio.h>    \r\nint main(){    \r\nprintf(\"Hello C Language\");    \r\nreturn 0;   \r\n}  \r\n#include <stdio.h> includes the standard input output library functions. The printf() function is defined in stdio.h .\r\n\r\n\r\nint main() The main() function is the entry point of every program in c language.\r\n\r\nprintf() The printf() function is used to print data on the console.\r\n\r\nreturn 0 The return 0 statement, returns execution status to the OS. The 0 value is used for successful execution and 1 for unsuccessful execution."},{"_id":"d5","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"What is compilation?","bio":"The compilation is a process of converting the source code into object code. It is done with the help of the compiler. The compiler checks the source code for the syntactical or structural errors, and if the source code is error-free, then it generates the object code.\r\n\r\nThe c compilation process converts the source code taken as input into the object code or machine code. The compilation process can be divided into four steps, i.e., Pre-processing, Compiling, Assembling, and Linking.\r\n\r\nThe preprocessor takes the source code as an input, and it removes all the comments from the source code. The preprocessor takes the preprocessor directive and interprets it. For example, if <stdio.h>, the directive is available in the program, then the preprocessor interprets the directive and replace this directive with the content of the 'stdio.h' file.\r\n\r\n\r\nThe following are the phases through which our program passes before being transformed into an executable form:\r\n\r\n1.Preprocessor\r\n2.Compiler\r\n3.Assembler\r\n4.Linker"},{"_id":"d6","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"printf() and scanf() in c","bio":"The printf() and scanf() functions are used for input and output in C language. Both functions are inbuilt library functions, defined in stdio.h (header file).\r\n\r\nprintf() function\r\n\r\nThe printf() function is used for output. It prints the given statement to the console.\r\n\r\nThe syntax of printf() function is given below:\r\n\r\n\r\nprintf(\"format string\",argument_list);  \r\nThe format string can be %d (integer), %c (character), %s (string), %f (float) etc.\r\n\r\nscanf() function\r\n\r\nThe scanf() function is used for input. It reads the input data from the console.\r\n\r\nscanf(\"format string\",argument_list);  "},{"_id":"d7","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"Variable in c","bio":"A variable is a name of the memory location. It is used to store data. Its value can be changed, and it can be reused many times.\r\n\r\nIt is a way to represent memory location through symbol so that it can be easily identified.\r\n\r\nLet's see the syntax to declare a variable:\r\n\r\n\r\ntype variable_list;  \r\nThe example of declaring the variable is given below:\r\n\r\nint a;  \r\nfloat b;  \r\nchar c;  \r\nHere, a, b, c are variables. The int, float, char are the data types.\r\n\r\nWe can also provide values while declaring the variables as given below:\r\n\r\nint a=10,b=20;//declaring 2 variable of integer type  \r\nfloat f=20.8;  \r\nchar c='A';  \r\nRules for defining variables\r\nA variable can have alphabets, digits, and underscore.\r\nA variable name can start with the alphabet, and underscore only. It can't start with a digit.\r\nNo whitespace is allowed within the variable name.\r\nA variable name must not be any reserved word or keyword, e.g. int, float, etc."},{"_id":"d8","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"Types of variable","bio":"There are many types of variables in c:\r\n\r\nlocal variable\r\nglobal variable\r\nstatic variable\r\nautomatic variable\r\nexternal variable\r\nLocal Variable\r\nA variable that is declared inside the function or block is called a local variable.\r\n\r\nIt must be declared at the start of the block.\r\n\r\nvoid function1(){  \r\nint x=10;//local variable  \r\n}  \r\nYou must have to initialize the local variable before it is used.\r\n\r\nGlobal Variable\r\nA variable that is declared outside the function or block is called a global variable. Any function can change the value of the global variable. It is available to all the functions.\r\n\r\nIt must be declared at the start of the block.\r\n\r\nint value=20;//global variable  \r\nvoid function1(){  \r\nint x=10;//local variable  \r\n}  \r\nStatic Variable\r\nA variable that is declared with the static keyword is called static variable.\r\n\r\nIt retains its value between multiple function calls.\r\n\r\nvoid function1(){  \r\nint x=10;//local variable  \r\nstatic int y=10;//static variable  \r\nx=x+1;  \r\ny=y+1;  \r\nprintf(\"%d,%d\",x,y);  \r\n}  \r\nIf you call this function many times, the local variable will print the same value for each function call, e.g, 11,11,11 and so on. But the static variable will print the incremented value in each function call, e.g. 11, 12, 13 and so on.\r\n\r\nAutomatic Variable\r\nAll variables in C that are declared inside the block, are automatic variables by default. We can explicitly declare an automatic variable using auto keyword.\r\n\r\nvoid main(){  \r\nint x=10;//local variable (also automatic)  \r\nauto int y=20;//automatic variable  \r\n}  \r\nExternal Variable\r\nWe can share a variable in multiple C source files by using an external variable. To declare an external variable, you need to use extern keyword.\r\n\r\nmyfile.h\r\n\r\nextern int x=10;//external variable (also global)  "},{"_id":"d9","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"c Identifiers","bio":"C identifiers represent the name in the C program, for example, variables, functions, arrays, structures, unions, labels, etc. An identifier can be composed of letters such as uppercase, lowercase letters, underscore, digits, but the starting letter should be either an alphabet or an underscore. If the identifier is not used in the external linkage, then it is called as an internal identifier. If the identifier is used in the external linkage, then it is called as an external identifier.\r\n\r\nWe can say that an identifier is a collection of alphanumeric characters that begins either with an alphabetical character or an underscore, which are used to represent various programming elements such as variables, functions, arrays, structures, unions, labels, etc. There are 52 alphabetical characters (uppercase and lowercase), underscore character, and ten numerical digits (0-9) that represent the identifiers. There is a total of 63 alphanumerical characters that represent the identifiers."},{"_id":"d10","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c_logo-scaled.jpg","name":"Types of Identifier","bio":"Types of identifiers\r\nInternal identifier\r\nExternal identifier\r\nInternal Identifier\r\n\r\nIf the identifier is not used in the external linkage, then it is known as an internal identifier. The internal identifiers can be local variables.\r\n\r\nExternal Identifier\r\n\r\nIf the identifier is used in the external linkage, then it is known as an external identifier. The external identifiers can be function names, global variables."}]