[{"_id":"c1","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"What is C++","bio":"C++ is a statically typed, compiled, general-purpose, case-sensitive, free-form programming language that supports procedural, object-oriented, and generic programming.\r\n\r\nC++ is regarded as a middle-level language, as it comprises a combination of both high-level and low-level language features.\r\n\r\nC++ was developed by Bjarne Stroustrup starting in 1979 at Bell Labs in Murray Hill, New Jersey, as an enhancement to the C language and originally named C with Classes but later it was renamed C++ in 1983.\r\n\r\nC++ is a superset of C, and that virtually any legal C program is a legal C++ program.\r\n\r\nNote − A programming language is said to use static typing when type checking is performed during compile-time as opposed to run-time."},{"_id":"c2","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"Why use c++","bio":"C++ is one of the world's most popular programming languages.\r\n\r\nC++ can be found in today's operating systems, Graphical User Interfaces, and embedded systems.\r\n\r\nC++ is an object-oriented programming language which gives a clear structure to programs and allows code to be reused, lowering development costs.\r\n\r\nC++ is portable and can be used to develop applications that can be adapted to multiple platforms.\r\n\r\nC++ is fun and easy to learn!\r\n\r\nAs C++ is close to C# and Java, it makes it easy for programmers to switch to C++ or vice versa"},{"_id":"c3","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"C++ features","bio":"C++ is object oriented programming language. It provides a lot of features that are given below.\r\n\r\nSimple\r\nMachine Independent or Portable\r\nMid-level programming language\r\nStructured programming language\r\nRich Library\r\nMemory Management\r\nFast Speed\r\nPointers\r\nRecursion\r\nExtensible\r\nObject Oriented\r\nCompiler based"},{"_id":"c4","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"c++ installation","bio":"To start using C++, you need two things:\r\n\r\nA text editor, like Notepad, to write C++ code\r\nA compiler, like GCC, to translate the C++ code into a language that the computer will understand\r\nThere are many text editors and compilers to choose from. In this tutorial, we will use an IDE (see below).\r\n\r\nC++ Install IDE\r\nAn IDE (Integrated Development Environment) is used to edit AND compile the code.\r\n\r\nPopular IDE's include Code::Blocks, Eclipse, and Visual Studio. These are all free, and they can be used to both edit and debug C++ code.\r\n\r\nNote: Web-based IDE's can work as well, but functionality is limited.\r\n\r\nWe will use Code::Blocks in our tutorial, which we believe is a good place to start.\r\n\r\nYou can find the latest version of Codeblocks at http://www.codeblocks.org/downloads/26. Download the mingw-setup.exe file, which will install the text editor with a compiler."},{"_id":"c5","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"c++ syntax with explained example","bio":"Example\r\n#include <iostream>\r\nusing namespace std;\r\n\r\nint main() {\r\n  cout << \"Hello World!\";\r\n  return 0;\r\n}\r\n\r\nExample explained\r\n\r\nLine 1: #include <iostream> is a header file library that lets us work with input and output objects, such as cout (used in line 5). Header files add functionality to C++ programs.\r\n\r\nLine 2: using namespace std means that we can use names for objects and variables from the standard library.\r\n\r\nLine 3: A blank line. C++ ignores white space.\r\n\r\nLine 4: Another thing that always appear in a C++ program, is int main(). This is called a function. Any code inside its curly brackets {} will be executed.\r\n\r\nLine 5: cout (pronounced \"see-out\") is an object used together with the insertion operator (<<) to output/print text. In our example it will output \"Hello World\".\r\nRemember: The compiler ignores white spaces. However, multiple lines makes the code more readable.\r\n\r\nLine 6: return 0 ends the main function\r\n\r\nLine 7: Do not forget to add the closing curly bracket } to actually end the main function."},{"_id":"c6","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"c++ Variables","bio":"Variables are containers for storing data values.\r\n\r\nIn C++, there are different types of variables (defined with different keywords), for example:\r\n\r\nint - stores integers (whole numbers), without decimals, such as 123 or -123\r\ndouble - stores floating point numbers, with decimals, such as 19.99 or -19.99\r\nchar - stores single characters, such as 'a' or 'B'. Char values are surrounded by single quotes\r\nstring - stores text, such as \"Hello World\". String values are surrounded by double quotes\r\nbool - stores values with two states: true or false"},{"_id":"c7","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"Function in c++","bio":"A function is a group of statements that together perform a task. Every C++ program has at least one function, which is main(), and all the most trivial programs can define additional functions.\r\n\r\nYou can divide up your code into separate functions. How you divide up your code among different functions is up to you, but logically the division usually is such that each function performs a specific task.\r\n\r\nA function declaration tells the compiler about a function's name, return type, and parameters. A function definition provides the actual body of the function.\r\n\r\nThe C++ standard library provides numerous built-in functions that your program can call. For example, function strcat() to concatenate two strings, function memcpy() to copy one memory location to another location and many more functions.\r\n\r\nA function is known with various names like a method or a sub-routine or a procedure etc.\r\n\r\nDefining a Function\r\n\r\nThe general form of a C++ function definition is as follows −\r\n\r\nreturn_type function_name( parameter list ) {\r\n   body of the function\r\n}"},{"_id":"c8","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"Array in c++","bio":"C++ provides a data structure, the array, which stores a fixed-size sequential collection of elements of the same type. An array is used to store a collection of data, but it is often more useful to think of an array as a collection of variables of the same type.\r\n\r\nInstead of declaring individual variables, such as number0, number1, ..., and number99, you declare one array variable such as numbers and use numbers[0], numbers[1], and ..., numbers[99] to represent individual variables. A specific element in an array is accessed by an index.\r\n\r\nAll arrays consist of contiguous memory locations. The lowest address corresponds to the first element and the highest address to the last element.\r\n\r\nDeclaring Arrays\r\n\r\nTo declare an array in C++, the programmer specifies the type of the elements and the number of elements required by an array as follows −\r\n\r\ntype arrayName [ arraySize ];"},{"_id":"c9","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"String in c++","bio":"Strings are used for storing text.\r\n\r\nA string variable contains a collection of characters surrounded by double quotes:\r\n\r\nExample\r\nCreate a variable of type string and assign it a value:\r\n\r\nstring greeting = \"Hello\";\r\n\r\nTo use strings, you must include an additional header file in the source code, the <string> library"},{"_id":"c10","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/c-scaled.jpg","name":"c++ conditions","bio":"C++ supports the usual logical conditions from mathematics:\r\n\r\nLess than: a < b\r\nLess than or equal to: a <= b\r\nGreater than: a > b\r\nGreater than or equal to: a >= b\r\nEqual to a == b\r\nNot Equal to: a != b\r\nYou can use these conditions to perform different actions for different decisions.\r\n\r\nC++ has the following conditional statements:\r\n\r\nUse if to specify a block of code to be executed, if a specified condition is true\r\nUse else to specify a block of code to be executed, if the same condition is false\r\nUse else if to specify a new condition to test, if the first condition is false\r\nUse switch to specify many alternative blocks of code to be executed"}]