[{"_id":"5e608a2c3f0a448eeb52ab9e","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is Java","bio":"Java is a popular programming language, created in 1995. It is owned by Oracle, and more than 3 billion devices run Java. It is used for: \n Mobile applications (specially Android apps)\n Desktop applications \n Web applications \n Web servers and application servers \n Games \n Database connection \n And much, much more! "},{"_id":"5e608a2c4ee75b514af3db14","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"Why use Java?","bio":"Java works on different platforms (Windows, Mac, Linux, Raspberry Pi, etc.)\n It is one of the most popular programming language in the world. \n It is easy to learn and simple to use. \n It is open-source and free. \n It is secure, fast and powerful. \n It has a huge community support (tens of millions of developers)\\n Java is an object oriented language which gives a clear structure to programs and allows code to be reused, lowering development costs\\n As Java is close to C++ and C#, it makes it easy for programmers to switch to Java or vice versa"},{"_id":"5e608a2cd6cff7307236d69b","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"Install Java","bio":"1. Go to \"System Properties\" (Can be found on Control Panel > System and Security > System > Advanced System Settings)\r\n\r\n2. Click on the \"Environment variables\" button under the \"Advanced\" tab\r\n\r\n3. Then, select the \"Path\" variable in System variables and click on the \"Edit\" button\r\n\r\n4. Click on the \"New\" button and add the path where Java is installed, followed by \\bin. By default, Java is installed in C:\\Program Files\\Java\\jdk-11.0.1 (If nothing else was specified when you installed it). In that case, You will have to add a new path with: C:\\Program Files\\Java\\jdk-11.0.1\\bin\r\n\r\n5. Then, click \"OK\", and save the settings\r\n\r\n6. At last, open Command Prompt (cmd.exe) and type java -version to see if Java is running on your machine"},{"_id":"1","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"Install Eclipse to Run Java","bio":"Following is a step by step guide to download and install Eclipse IDE:\r\nStep 1) Installing Eclipse\r\nOpen your browser and type https://www.eclipse.org/\r\nStep 2) Click on \"Download\" button.\r\nStep 3) Click on \"Download 64 bit\" button\r\nStep 4) Click on \"Download\" button\r\nStep 4) Install Eclipse.\r\n    1.Click on \"downloads\" in Windows file explorer.\r\n    2.Click on \"eclipse-inst-win64.exe\" file.\r\nStep 5) Click on Run button\r\nStep 6) Click on \"Eclipse IDE for Java Developers\"\r\nStep 7) Click on \"INSTALL\" button\r\nStep 8) Click on \"LAUNCH\" button\r\nStep 9) Click on \"Launch\" button\r\nStep 10) Click on \"Create a new Java project\" link\r\nStep 11) Create a new Java Project\r\n    1.Write project name.\r\n    2.Click on \"Finish button\".\r\n"},{"_id":"2","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"Create Your First Java Program","bio":"Step 1) Open Notepad from Start menu by selecting Programs > Accessories > Notepad\r\n\r\nStep 2) Create a Source Code for your Program as given:\r\n\r\n class A {\r\n public static void main(String args[]){\r\n     System.out.println(\"Hello World\");\r\n }\r\n}\r\n\r\nStep 3) Save the file as FirstProgram.java make sure to select file type as all files while saving the file in our working folder C:\\workspace\r\n\r\nStep 4) Open the command prompt. Go to Directory C:\\workspace. Compile the code using command,\r\n\r\njavac FirstProgram.java\r\n\r\n\r\nStep 5) If you look in your working folder, you can see that a file named A.class has been created.\r\n\r\nStep 6) To execute the code, enter the command java followed by the class name, as expected output Hello World is displayed now.\r\n\r\njava A\r\n"},{"_id":"3","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is OOPS?","bio":"OBJECT ORIENTED PROGRAMMING (OOP) is a programming concept that works on the principles of abstraction, encapsulation, inheritance, and polymorphism. It allows users to create the objects that they want and then, create methods to handle those objects. The basic concept of OOPs is to create objects, re-use them throughout the program, and manipulate these objects to get results.\r\nObject Oriented Programming popularly known as OOP, is used in a modern programming language like Java.\r\n\r\nCore OOPS concepts are\r\n1) Class\r\n2) Object\r\n3) Inheritance\r\n4) Polymorphism\r\n5) Abstraction\r\n6) Encapsulation\r\n7) Association\r\n8) Aggregation\r\n9) Composition"},{"_id":"4","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is Abstraction in OOP?","bio":"ABSTRACTION is the concept of object-oriented programming that \"shows\" only essential attributes and \"hides\" unnecessary information. The main purpose of abstraction is hiding the unnecessary details from the users. Abstraction is selecting data from a larger pool to show only relevant details of the object to the user. It helps in reducing programming complexity and efforts. It is one of the most important concepts of OOPs."},{"_id":"5","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is Encapsulation in Java?","bio":"Encapsulation in Java is a mechanism to wrap up variables(data) and methods(code) together as a single unit. It is the process of hiding information details and protecting data and behavior of the object. It is one of the four important OOP concepts. The encapsulate class is easy to test, so it is also better for unit testing."},{"_id":"6","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is a Variable in Java?","bio":"\r\nWhat is a Variable in Java?\r\nVariable in Java is a data container that stores the data values during Java program execution. Every variable is assigned data type which designates the type and quantity of value it can hold. Variable is a memory location name of the data. The Java variables have mainly three types : Local, Instance and Static.\r\n\r\nIn order to use a variable in a program you to need to perform 2 steps\r\n\r\n1.Variable Declaration\r\n2.Variable Initialization"},{"_id":"7","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"Types of variables","bio":"In Java, there are three types of variables:\r\n\r\n1.Local Variables\r\n2.Instance Variables\r\n3.Static Variables\r\n1) Local Variables\r\nLocal Variables are a variable that are declared inside the body of a method.\r\n\r\n2) Instance Variables\r\nInstance variables are defined without the STATIC keyword .They are defined Outside a method declaration. They are Object specific and are known as instance variables.\r\n\r\n3) Static Variables\r\nStatic variables are initialized only once, at the start of the program execution. These variables should be initialized first, before the initialization of any instance variables."},{"_id":"8","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is Data Types in Java?","bio":"Data Types in Java are defined as specifiers that allocate different sizes and types of values that can be stored in the variable or an identifier. Java has a rich set of data types. Data types in Java can be divided into two parts :\r\n\r\nPrimitive Data Types :- which include integer, character, boolean, and float\r\nNon-primitive Data Types :- which include classes, arrays and interfaces.\r\n\r\nPrimitive Data Types are predefined and available within the Java language. Primitive values do not share state with other primitive values.\r\nThere are 8 primitive types: byte, short, int, long, char, float, double, and boolean Integer data types\r\n\r\n"},{"_id":"9","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is Class and Object in Java OOPS?","bio":"CLASS are a blueprint or a set of instructions to build a specific type of object. It is a basic concept of Object-Oriented Programming which revolve around the real-life entities. Class in Java determines how an object will behave and what the object will contain.\r\nSyntax:\r\nclass <class_name>{  \r\n    field;  \r\n    method;  \r\n  }  \r\n\r\nWhat is Object in Java?\r\nOBJECT is an instance of a class. An object is nothing but a self-contained component which consists of methods and properties to make a particular type of data useful. For example color name, table, bag, barking. When you send a message to an object, you are asking the object to invoke or execute one of its methods as defined in the class.\r\nFrom a programming point of view, an object can include a data structure, a variable, or a function. It has a memory location allocated. The object is designed as class hierarchies.\r\nSyntax:\r\nClassName ReferenceVariable = new ClassName();"},{"_id":"10","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is Java Array?","bio":"Java Array is a very common type of data structure which contains all the data values of the same data type. The data items put in the array are called elements and the first element in the array starts with index zero. Arrays inherit the object class and implement the serializable and cloneable interfaces. We can store primitive values or objects in an array.\r\n\r\nIn simple words, it’s a programming construct which helps to replace this\r\n\r\nx0=0;\r\nx1=1;\r\nx2=2;\r\nx3=3;\r\nx4=4;\r\nx5=5;\r\nwith this …\r\n\r\nx[0]=0;\r\nx[1]=1;\r\nx[2]=2;\r\nx[3]=3;\r\nx[4]=4;\r\nx[5]=5;"},{"_id":"11","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What Is An Array Of Objects?","bio":"JAVA ARRAY OF OBJECT, as defined by its name, stores an array of objects. Unlike a traditional array that store values like string, integer, Boolean, etc an array of objects stores OBJECTS. The array elements store the location of the reference variables of the object.\r\n\r\nSyntax:\r\n\r\nClass obj[]= new Class[array_length]"},{"_id":"12","picture":"https://findjobalerts.com/wp-content/uploads/2020/07/java_logo-1.png","name":"What is ArrayList in Java?","bio":"ArrayList is a data structure that can be stretched to accommodate additional elements within itself and shrink back to a smaller size when elements are removed. It is a very important data structure useful in handling the dynamic behavior of elements.\r\nArrays are like the rope. They will have a fixed length, cannot be expanded nor reduced from the original length.\r\n\r\nSo our stretchable rubber-band is much like the Array List whereas the rope can be considered as the array.\r\n\r\nTechnically speaking, java Array List is like a dynamic array or a variable-length array.\r\n\r\nLet us see and understand the following code snippet that will help you work around with Array List.\r\n\r\nArrayList<Object> a = new ArrayList<Object>();"}]